

data=[
    #none
    [
        "",
        "",
        "",
        "",
    ],
    #question1
    [
    "אני לגמרי מרגיש/ה שיש לי רצון לקחת על עצמי משימות שדורשות ממני להיות אחראי/ת על אחרים.",
    "אני מרגיש/ה ברוב המקרים שיש לי רצון לקחת על עצמי משימות שדורשות ממני להיות אחראי/ת על אחרים.",
    "לעיתים אני מרגיש/ה שיש לי רצון לקחת על עצמי משימות שדורשות ממני להיות אחראי/ת על אחרים.",
    "בדרך כלל אני לא מרגיש/ה שיש לי רצון לקחת על עצמי משימות שדורשות ממני להיות אחראי/ת על אחרים.",
    "אין לי רצון כלל לקחת על עצמי משימות שדורשות ממני להיות אחראי/ת על אחרים."
    ],
    #question2
    [
    "קורה לי לעיתים קרובות מאוד שאני חושב/ת על דברים רעים שקרו לי.",
    "קורה לי לעיתים קרובות שאני חושב/ת על דברים רעים שקרו לי.",
    "מדי פעם קורה לי שאני חושב/ת על דברים רעים שקרו לי.",
    "כמעט ולא קורה לי שאני חושב/ת על דברים רעים שקרו לי.",
    "זה כמעט לא קורה לי בכלל שאני חושב/ת על דברים רעים שקרו לי."
    ],
    #question3
     [
    "אני לגמרי מסכים/ה עם האמירה שאי אפשר באמת לתכנן את העתיד כי דברים משתנים כל הזמן.",
    "אני מסכים/ה ברוב המקרים עם האמירה שאי אפשר לתכנן את העתיד כי דברים משתנים לעיתים קרובות.",
    "לפעמים אני מרגיש/ה שאי אפשר באמת לתכנן את העתיד, כי יש מצבים שבהם דברים פשוט משתנים.",
    "לרוב אני מאמין/ה שאפשר לתכנן את העתיד, גם אם יש שינויים שצצים בדרך.",
    "אני ממש לא מסכים עם האמירה שבגלל שדברים משתנים כל הזמן אי אפשר לתכנן את העתיד, אלא להפך, אני מאמין שבהחלט אפשר על אף שינויים"
    ],
     #question4
    [
    "אני לגמרי מרגיש/ה שתחת לחץ אני מצליח/ה להישאר ממוקד/ת ולחשוב באופן צלול.",
    "אני מרגיש/ה לרוב שתחת לחץ אני נשאר/ת ממוקד/ת וחושב/ת בבהירות.",
    "לפעמים אני מצליח/ה להישאר מרוכז/ת ולחשוב בבהירות גם כשאני תחת לחץ.",
    "לרוב אני מתקשה להישאר ממוקד/ת ולחשוב בצורה צלולה כשאני תחת לחץ.",
    "אין לי יכולת להישאר ממוקד/ת או לחשוב בבהירות תחת לחץ, זה ממש לא קורה לי."
    ],
    #question5
    [
    "מייאש אותי לעשות משהו שאני אראה את התוצאות שלו רק בעוד הרבה זמן.",
    "אני מרגיש/ה ברוב המקרים מיואש כאשר עליי לעשות דברים שרק בהמשך הרחוק אראה את תוצאותיהם.",
    "לפעמים אני מרגיש/ה קושי או ייאוש כשמדובר בפרויקטים שהתוצאות שלהם יגיעו רק אחרי הרבה זמן.",
    "בדרך כלל, אין לי בעיה לעשות משהו שאני אראה את התוצאות שלו רק בעוד הרבה זמן.",
    "בכלל לא מייאש אותי לעשות משהו שאני אראה את התוצאות שלו רק בעוד הרבה זמן, אני בסדר גמור עם משימות ארוכות טווח."
    ],
    #question6
    [
    "יש לי נטייה חזקה להרגיש תחושות של נוסטלגיה על דברים שקרו בעבר שלי.",
    "יש לי נטיה מסוימת להרגיש תחושות של נוסטלגיה על דברים שקרו בעבר שלי.",
    "לפעמים אני מרגיש/ה נוסטלגיה כשאני חושב/ת על דברים שקרו לי בעבר.",
    "בדרך כלל אני לא מרגיש/ה נוסטלגיה כשאני נזכר/ת באירועים שקרו לי בעבר.",
    "אני כמעט ולא חש/ה נוסטלגיה ביחס לעבר שלי, זה לא משהו שמאפיין אותי בכלל."
    ],
    #question7
     [
    "אני לגמרי מקפיד/ה לסיים את כל המטלות למחר לפני שאני בכלל חושב/ת לצאת לבלות או לנוח באותו ערב.",
    "אני ברוב המקרים אקפיד לסיים את המטלות למחר לפני בילוי או מנוחה בערב.",
    "לעיתים אני דוחה בילוי או מנוחה עד שאסיים לפחות חלק מהמטלות למחר.",
    "לרוב אני לא מקפיד/ה לסיים את כל המטלות למחר לפני שאני יוצא לבלות או לנוח בערב.",
    "אני אף פעם לא מסיים את המטלות למחר לפני שאצא לבלות או לנוח בערב של אותו יום."
    ],
    #question8
    [
    "אני תמיד עומד/ת בכל ההבטחות שאני נותנ/ת לחברים, למורים או להורים שלי, בלי יוצא מן הכלל.",
    "לרוב אני עומד/ת בהבטחות שלי לחברים, למורים או להורים, עם מעט מאוד החרגות.",
    "אני משתדל/ת לעמוד ברוב ההבטחות שלי, אבל לפעמים אני לא מצליח/ה.",
    "לעיתים קרובות אני לא מצליח/ה לעמוד בהבטחות שלי לחברים, למורים או להורים.",
    "אני כמעט אף פעם לא עומד/ת בהבטחות שלי לחברים, למורים או להורים שלי."
    ],
    #question9
    [
    "אני תמיד עובד/ת באופן עקבי על פרויקטים, וכך מסיים/ת אותם בזמן בלי צורך לדחות הכול לרגע האחרון.",
    "בדרך כלל אני משקיע/ה לאורך זמן בפרויקטים, וכך מצליח/ה לסיים אותם בזמן.",
    "לפעמים אני עובד/ת לאורך זמן, ולפעמים ברגע האחרון, אבל בדרך כלל מספיק/ה להגיש בזמן.",
    "לרוב אני דוחה דברים לרגע האחרון, וקשה לי לעמוד בלוחות הזמנים אם אין לחץ משמעותי בסוף.",
    "אין לי בכלל יכולת לעבוד על פרויקטים לאורך זמן, אני תמיד דוחה אותם ומתקשה לסיים בזמן."
    ],
    #question10
    [
    "אני לגמרי צריך/ה שמישהו אחר יפרגן ויחמיא לי על העבודה שלי כדי שאהיה מרוצה ממה שעשיתי.",
    "ברוב המקרים אני צריך/ה שמישהו אחר יפרגן ויחמיא לי על העבודה שלי כדי שאהיה מרוצה ממה שעשיתי.",
    "לפעמים אני צריך/ה פרגון והערכה מאחרים כדי להרגיש מרוצה ממה שעשיתי.",
    "בדרך כלל אני לא צריך/ה פרגון מאחרים כדי להיות מרוצה ממה שעשיתי.",
    "אני בכלל לא צריך/ה שאחרים יחמיאו לי כדי שאהיה מרוצה ממה שעשיתי."
    ],
    #question11
    [
    "אני ממש נוטה להסחף ברגע ולאבד את עצמי כשאני מתרגש/ת ממשהו.",
    "בדרך כלל אני נוטה להסחף ולהתלהב עד כדי לאבד את עצמי כשאני מתרגש/ת.",
    "לפעמים אני נסחף/ת ברגע כשאני מתרגש/ת ממשהו ומאבד/ת מעט שליטה.",
    "בדרך כלל אני לא נסחף/ת עד כדי לאבד את עצמי כשאני מתרגש/ת.",
    "אני כמעט אף פעם לא נסחף/ת עד כדי לאבד את עצמי כשאני מתרגש/ת."
    ],
    #question12
    [
    "כשאני חלק מפרויקט או משימה שמישהו/י אחר אחראי/ת עליה, אני לגמרי רוצה לברר כל פרט לגבי מה שקורה",
    "כשאני חלק מפרויקט או משימה שמישהו/י אחר אחראי/ת עליה, ברוב המקרים יש לי רצון לברר כמה שיותר על מה שקורה",
    "לעיתים אני רוצה להבין יותר לעומק מה קורה בפרויקט או משימה שמישהו אחר אחראי עליה, במיוחד אם אני חלק מזה.",
    "כשאני חלק מפרויקט או משימה שמישהו/י אחר אחראי/ת עליה, רוב הזמן אני לא מרגיש/ה צורך לברר כל פרט בפרויקט",
    "כשאני חלק מפרויקט או משימה שמישהו/י אחר אחראי/ת עליה, אין לי שום צורך מיוחד להבין או לברר כל מה שאני יכול על מה שקורה"
    ],
    #question13
    [
    "יש לי הרבה זיכרונות לא נעימים בעבר, ואני מאוד רוצה שלא לחשוב עליהם.",
    "יש לי לא מעט זיכרונות לא נעימים מהעבר שאני מעדיף/ה לא לחשוב עליהם.",
    "פה ושם צצים לי זיכרונות לא נעימים מהעבר, שלא תמיד הייתי רוצה לחשוב עליהם.",
    "אין לי הרבה זיכרונות לא נעימים שאני מנסה שלא לחשוב עליהם, אולי רק כמה.",
    "אין לי כמעט בכלל זיכרונות לא נעימים מהעבר שאני מנסה להימנע מלחשוב עליהם."
    ],
    #question14
    [
    "אני מתאושש/ת מהר כמעט מכל מחלה, פציעה או קושי שאני נתקל/ת בו.",
    "ברוב הזמן אני מתאושש/ת בקלות ממחלות, פציעות או קשיים שאני חווה.",
    "לפעמים אני מתאושש/ת די מהר מקשיים, ולפעמים זה לוקח לי יותר זמן.",
    "לרוב אני לא מתאושש/ת כל כך מהר לאחר מחלה, פציעה או כל קושי שאני נתקל בו.",
    "אני בכלל לא מתאושש/ת מהר לאחר מחלה, פציעה או קושי; זה בדרך כלל לוקח לי הרבה זמן."
    ],
    #question15
    [
    "אני לגמרי חושב/ת שאין שום טעם לדאוג לעתיד, כי אין שום דרך להשפיע עליו.",
    "בעיני, רוב הזמן אין טעם לדאוג לעתיד, כי ממילא אין לי הרבה השפעה עליו.",
    "אני מדי פעם חושב/ת שאין הרבה טעם לדאוג לעתיד, כי התחושה היא שאין לי איך לשלוט בו.",
    "לרוב אני חושב שלדאוג לגבי העתיד זה הגיוני, כי אפשר וחשוב להשפיע אליו.",
    "אני חושב/ת שיש משמעות לדאוג לעתיד, כי בהחלט אפשר להשפיע עליו – כך שהאמירה \"זה לא הגיוני לדאוג לגבי העתיד\" לא מתאימה לי בכלל."
    ],
    #question16
    [
    "לעיתים קרובות מאוד עולים לי זיכרונות נעימים מהעבר.",
    "לעיתים קרובות עולים בי זיכרונות נעימים מהעבר.",
    "לעיתים עולים בי זיכרונות נעימים מהעבר, אבל לא באופן תדיר.",
    "רק לעיתים רחוקות עולים בי זיכרונות נעימים מהעבר.",
    "אף פעם לא עולים בי זכרונות נעימים מהעבר."
    ],
    #question17
    [
    "מאוד קשה לי לשכוח מצבים לא נעימים מהילדות שלי, הם נשארים איתי חזק.",
    "לרוב קשה לי לשכוח סיטואציות לא נעימות מהילדות שלי.",
    "לפעמים קשה לי לשכוח חוויות לא נעימות מהילדות, אבל לא כל הזמן.",
    "בדרך כלל אני מצליח/ה לשכוח או לעבד מצבים לא נעימים מהילדות.",
    "אני לא מרגיש/ה שקשה לי לשכוח סיטואציות לא נעימים מהילדות שלי; הן לא מטרידות אותי."
    ],
    #question18
    [
    "אני משוכנע/ת במאה אחוז שהתמודדות עם לחץ וקושי הופכת אותי לחזק/ה יותר.",
    "לרוב אני מאמין שהתמודדות עם לחץ וקושי הופכת אותי לחזק/ה יותר.",
    "לפעמים אני מרגיש/ה שהתמודדות עם לחץ מחזקת אותי, ולפעמים לא ממש.",
    "אני לא כל כך מסכים שהתמודדות עם לחץ וקושי יכולים להפוך אותי לחזק יותר.",
    "התמודדות עם לחץ וקושי בכלל לא מחזקת אותי, אפילו להפך."
    ],
    #question19
    [
    "אני תמיד לא מתייאש/ת בקלות מכישלון.",
    "לרוב אני לא מתייאש/ת בקלות מכישלון.",
    "לפעמים אני לא מתייאש/ת בקלות מכישלון, אבל יש מצבים שקשה לי להמשיך.",
    "אפשר להגיד שאני די מתייאש בקלות בעקבות כישלון.",
    "אני תמיד מתייאש בקלות מכישלון."
    ],
    #question20
    [
    "תמיד הצלחתי להתגבר על כישלונות שהיו לי בעבר והגעתי למטרות החשובות לי.",
    "לרוב הצלחתי להתגבר על כישלונות שהיו לי בעבר ולהגיע למטרות החשובות לי.",
    "לפעמים הצלחתי להתגבר על כישלונות בעבר וכך הגעתי לחלק מהמטרות שלי.",
    "לרוב לא התגברתי בעבר על כשלונות, על אף מטרות חשובות או משמעותיות שהיו לי.",
    "אני לא זוכר שהצלחתי להתגבר בעבר על כישלונות בדרך למטרות שהיו לי חשובות או משמעותיות."
    ],
    #question21
    [
    "תמיד אני נהנה/ית לשמוע סיפורים על העבר וללמוד מהם.",
    "לעיתים קרובות אני אוהב/ת לשמוע סיפורים על העבר ולומד/ת מהם.",
    "לפעמים אני אוהב/ת לשמוע סיפורים על העבר, אבל לא תמיד זה מעניין אותי או מלמד אותי משהו.",
    "לעיתים רחוקות אני אוהב/ת לשמוע סיפורים על העבר – זה לא ממש תחום העניין שלי.",
    "אף פעם אני לא אוהב/ת לשמוע סיפורים על העבר, וזה לא מעניין אותי או תורם לי."
    ],
    #question22
    [
    "תמיד אני מרגיש/ה שרוב מה שיקרה לי בעתיד בלימודים ובעבודה תלוי בנסיבות שלא בשליטתי, ולכן הנסיבות משפיעות מאוד על חיי.",
    "לעיתים קרובות אני מרגיש/ה שלא מעט דברים שמחוץ לשליטתי יקבעו את עתידי בלימודים ועבודה",
    "לפעמים אני מרגיש/ה שיש גורמים חיצוניים המשפיעים על העתיד שלי, אבל אני גם רואה מקום לשליטה אישית.",
    "לעיתים רחוקות אני מרגיש/ה שדברים שאין לי שליטה עליהם משפיעים על עתידי; בדרך כלל אני מאמין/ה שהכול תלוי בי.",
    "אף פעם אני לא מרגיש/ה שדברים שאין לי שליטה עליהם משפיעים על חיי; אני סבור/ה שהכול תלוי בי."
    ],
    #question23
    [
    "היו לי המון דחיות וחוויות לא נעימות בעבר שלי.",
    "היו לי לא מעט דחיות דחיות וחוויות לא נעימות בעבר שלי.",
    "לפעמים חוויתי דחיות וחוויות לא נעימות בעבר, אבל לא המון.",
    "לא היו לי הרבה דחיות וחוויות לא נעימות בעבר שלי.",
    "כמעט ולא היו לי כמעט דחיות וחוויות לא נעימות בעבר שלי."
    ],
    #question24
    [
    "תמיד כשיש לי בעיה אני סומך/ת על עצות של חברים או משפחה ומיישם/ה אותן כמו שהן.",
    "כשיש לי בעיה, אני לרוב מקבל/ת את העצות של חברים או משפחה ועושה לפיהן",
    "לפעמים אני מקשיב/ה לעצות של חברים או קרובים ועושה מה שהם אומרים לי, תלוי בסיטואציה.",
    "לעיתים רחוקות אני נוטה להקשיב ולפעול בדיוק לפי עצות של חברים או קרובי משפחה כשיש לי בעיה.",
    "אף פעם אני לא פועל/ת לפי עצות של חברים או משפחה כשיש לי בעיה"
    ],
    #question25
    [
    "תמיד אני לוקח/ת סיכונים וכתוצאה מכך החיים שלי בכלל לא משעממים.",
    "לעיתים קרובות אני לוקח/ת סיכונים וזה עוזר לי להימנע משעמום.",
    "לפעמים אני לוקח/ת סיכונים וזה מוסיף עניין לחיים שלי, ולפעמים אני מעדיף/ה לשמור על בטיחות.",
    "לעיתים רחוקות אני לוקח/ת סיכונים; אני מעדיף/ה לא להסתכן יותר מדי.",
    "אף פעם אני לא לוקח/ת סיכונים; זה פשוט לא חלק מהחיים שלי."
    ],
    #question26
    [
    "תמיד אני מרגיש/ה שמשהו טוב שקורה לי זה כי באמת הגיע לי.",
    "לעיתים קרובות כשמשהו טוב קורה לי, אני מרגיש/ה שזה בזכותי ושמגיע לי.",
    "לפעמים אני מרגיש/ה שמשהו טוב קורה לי בגלל שזה הגיע לי, ולפעמים אני זוקף/ת את זה למזל או לנסיבות אחרות.",
    "לעיתים רחוקות אני מרגיש/ה שכמשהו טוב שקורה לי זה כי מגיע לי, לרוב אני חושב/ת שזה מזל או צירוף מקרים.",
    "אף פעם לא הרגשתי שמשהו טוב קורה לי כי הגיע לי, אני לא חושב/ת במושגים כאלה."
    ],
    #question27
    [
    "תמיד יש לי שליטה עצמית להתמודד עם פיתויים כשעליי לבצע משימה.",
    "לעיתים קרובות אני מצליח/ה להתגבר על פיתויים כשאני צריך/ה לבצע משימה.",
    "לפעמים אני יכול/ה לעמוד בפיתויים כשיש לי משימה, אבל לא תמיד זה מצליח.",
    "לעיתים רחוקות אני מצליח/ה לעמוד בפיתויים כשצריך לבצע משימה, זה לא תמיד מסתדר לי.",
    "אף פעם אין לי יכולת לעמוד בפיתויים כשיש לי משימה, אני נכנע/ת להם מייד."
    ]
    
]

def return_hamara(question_num,answer_num):
    return data[question_num][answer_num]

print(return_hamara(1,2))