

ids = {
    "Q1": " 🤔 באיזו מידה ההתנהגות למטה דומה לדרך שבה את/ה מתנהג/ת?",
    "ICI2": "1.  חוויות כואבות מהעבר ממשיכות להשפיע על קבלת ההחלטות שלי כיום",
    "ZPTI16": "2. ההתאוששות שלי ממצבים קשים או מאתגרים היא בדרך כלל מהירה ",
    "ZPTI10": "3. כשאני חושב/ת על העבר, הזכרונות שעולים הם בעיקר חוויות טובות",
    "RISC2": "4. אי אפשר באמת לתכנן את העתיד כי דברים שאין לי שליטה עליהם כל הזמן משתנים ",
    "ICI5": "5. גם במצבי לחץ, יש לי יכולת לשמור על מחשבה בהירה וקבלת החלטות טובות ",
    "ZPTI7": "6. הצלחה בלימודים תלויה בעיקר במזל ובנסיבות חיצוניות ",
    "Q2": "🔄 מה המידה שהנאמר למטה זהה לתפיסה שלך את עצמך?",
    "ICI4": "7. יש לי אמונה שקשיים מהווים הזדמנויות ללמידה וצמיחה",
    "ZPTI15": "8.נטילת סיכונים מוסיפה ריגוש לחיים שלי",
    "ICI7": "9. רוב האירועים המשמעותיים בחיים שלי מושפעים מגורמים שאינם בשליטתי",
    "ZPTI6": "10. קשה לי להציב לעצמי יעדים ארוכי טווח כדי לפעול להשגתם",
    "RISC1": "11. קיימת אצלי יכולת להתמודד בהצלחה עם שינויים בלתי צפויים",
    "ZPTI12": "12. יש לי נטייה להתעכב על אירועים שליליים שהתרחשו בעבר",
    "ZPTI3": "13. ההשגה של המטרות שלי היא תוצאה של המאמץ המושקע",
    "Q3": " 🔁 באיזו מידה המשפטים למטה מתארים את הדרך בה תתנהג/י או תחשוב/י",
    "RISC3": "14. יש המון דברים בחיים שאין עליהם שליטה ולכן אי אפשר לתכנן את העתיד",
    "GRT1": "15. יש לי נטייה ליהנות מהרגע בלי יותר מדי דאגות לגבי העתיד",
    "ZPTI2": "16. להחלטות שאני מקבל/ת היום יש השפעה משמעותית על העתיד שלי",
    "ZPTI11": "17.נעים לי להיזכר בזכרונות שמחים מהעבר",
    "ZPTI5": "18. יש לי את היכולת לשנות דברים בחיי שאני לא מרוצה מהם",
    "ICI6": "19. כשאני נתקל/ת במכשול, לרוב עולה תחושה של חוסר אונים וקושי להמשיך הלאה",
    "ZPTI8": "20. מאז תחילת השנה היכולת שלי לתכנן את הזמן שלי השתפרה בכל מה שקשור לניהול משימות ותכנון עתידי ",
}



def return_text_by_the_id(id_name):
    for key in ids:
        if key == id_name:
            return ids[key]
    return None

# print(return_id('Q2'))
