

# ids = {
#      "Q1": "🤔 באיזו מידה ההתנהגות למטה דומה לדרך שבה את/ה מתנהג?",
#     "ICI2": " יש לי רצון לקחת על עצמי משימות שדורשות ממני להיות אחראי/ת על אחרים 💪",
#     "ZPTI16": " קורה לי הרבה שאני חושב/ת על דברים רעים שקרו לי 😞",
#     "ZPTI10": " יש בי אמונה שאי אפשר באמת לתכנן את העתיד כי דברים משתנים כל הזמן 🤷‍♂️",
#     "RISC2": " גם תחת לחץ, יש לי יכולת להשאר בפוקוס ולחשוב באופן בהיר 🔍",
#     "ICI5": " מייאש אותי לעשות משהו שאני אראה את התוצאות שלו רק בעוד הרבה זמן 😓",
#     "ZPTI7": "יש לי נטייה להרגיש תחושות נעימות של נוסטלגיה כשאני נזכר בדברים שקרו לי בעבר 🌟",
#     "ZPTI1": " תמיד אסיים את כל המטלות למחר לפני שאצא לבלות או לנוח בערב של אותו היום ⏰",
#     "ZPTI4": " תמיד אעמוד בהבטחות שלי לחברים או לכל אחד אחר כמו המורה או ההורים שלי ✔️",
#     "ZPTI13": " אני תמיד אשלים פרויקטים בזמן על ידי כך שאעשה כל פעם קצת במהלך הפרויקט ולא את הכל ברגע האחרון🕰️",
#     "Q2": "🔄 מה המידה שהנאמר למטה זהה לתפיסה שלך את עצמך?",
#     "ICI4": " יש לי צורך שמישהו אחר יפרגן ויחמיא לי על העבודה שלי כדי שאהיה מרוצה ממה שעשיתי 🙌",
#     "ZPTI15": " יש לי נטייה להסחף ברגע כשאני מתרגש/ת ממשהו😲",
#     "ICI7": " כשאני חלק מפרויקט או משימה שמישהו/י אחר אחראי/ת עליה יש לי רצון לברר כל מה שאני יכול/ה על מה שקורה 🧐",
#     "ZPTI6": " יש בעבר שלי הרבה זכרונות לא נעימים שהייתי שמח לא לחשוב עליהם 💔",
#     "RISC1": " יש לי נטייה להתאושש במהירות לאחר מחלה, פציעה או כל קושי שאני נתקל בו 💪",
#     "ZPTI12": " זה לא הגיוני לדאוג לגבי העתיד, כי בכל מקרה אין שום דבר שאני יכול/ה לעשות כדי להשפיע עליו😐",
#     "ZPTI3": " קורה לי הרבה שעולים לי זכרונות נעימים מהעבר 🌸",
#     "ZPTI9": " קשה לי לשכוח סיטואציות ומצבים לא נעימים מהילדות שלי 😔",
#     "RISC4": " התמודדות עם לחץ וקושי יהפכו אותי לחזק/ה יותר.💥",
#     "Q3": "🔁 כשאת/ה חושב/ת על עצמך, באיזו מידה כל אחד מההיגדים למטה נכונים לגביך?",
#     "RISC3": " אני לא מתייאש/ת בקלות מכישלון. 🚫",
#     "GRT1": " התגברתי בעבר על כשלונות כדי להגיע למטרות שהיו לי חשובות או משמעותיות 🌟",
#     "ZPTI2": " אני מאוד אוהב/ת לשמוע סיפורים על העבר וללמוד מהם 📖",
#     "ZPTI11": " הרבה דברים שאין לי שליטה עליהם משפיעים על מה שיקרה לי בחיים בהמשך מבחינת לימודים, עבודה וקריירה 🌍",
#     "ZPTI5": " היו לי לא מעט דחיות וחוויות לא נעימות בעבר שלי ⚠️",
#     "ICI6": " כשיש לי בעיה אני תמיד אקשיב לעצות של חברים או קרובי משפחה ואעשה מה שהם אומרים לי👂",
#     "ZPTI8": " סיכונים שאני לוקח/ת מונעים מהחיים שלי להיות משעממים 🎢",
#     "ICI3": " בכל פעם שמשהו טוב קורה לי יש לי הרגשה שזה קרה לי כי זה הגיע לי ✨",
#     "ZPTI14": " יש לי יכולת לעמוד בפיתויים כשיש לי אחריות לבצע משימה🚫"
# }

ids = {
    "Q1": " 🤔 באיזו מידה ההתנהגות למטה דומה לדרך שבה את/ה מתנהג/ת?",
    "ICI2": "1. יש לי רצון לקחת על עצמי משימות שדורשות ממני להיות אחראי/ת על אחרים 💪",
    "ZPTI16": "2. קורה לי הרבה שאני חושב/ת על דברים רעים שקרו לי 😞",
    "ZPTI10": "3. יש בי אמונה שאי אפשר באמת לתכנן את העתיד כי דברים משתנים כל הזמן 🤷‍♂️",
    "RISC2": "4. גם תחת לחץ, יש לי יכולת להשאר בפוקוס ולחשוב באופן בהיר 🔍",
    "ICI5": "5. מייאש אותי לעשות משהו שאני אראה את התוצאות שלו רק בעוד הרבה זמן 😓",
    "ZPTI7": "6. יש לי נטייה להרגיש תחושות נעימות של נוסטלגיה כשאני נזכר בדברים שקרו לי בעבר 🌟",
    "ZPTI1": "7. תמיד אסיים את כל המטלות למחר לפני שאצא לבלות או לנוח בערב של אותו היום ⏰",
    "ZPTI4": "8. תמיד אעמוד בהבטחות שלי לחברים או לכל אחד אחר כמו המורה או ההורים שלי ✔️",
    "ZPTI13": "9. אני תמיד אשלים פרויקטים בזמן על ידי כך שאעשה כל פעם קצת במהלך הפרויקט ולא את הכל ברגע האחרון🕰️",
    "Q2": "🔄 מה המידה שהנאמר למטה זהה לתפיסה שלך את עצמך?",
    "ICI4": "10. יש לי צורך שמישהו אחר יפרגן ויחמיא לי על העבודה שלי כדי שאהיה מרוצה ממה שעשיתי 🙌",
    "ZPTI15": "11. יש לי נטייה להסחף ברגע כשאני מתרגש/ת ממשהו😲",
    "ICI7": "12. כשאני חלק מפרויקט או משימה שמישהו/י אחר אחראי/ת עליה יש לי רצון לברר כל מה שאני יכול/ה על מה שקורה 🧐",
    "ZPTI6": "13. יש בעבר שלי הרבה זכרונות לא נעימים שהייתי שמח לא לחשוב עליהם 💔",
    "RISC1": "14. יש לי נטייה להתאושש במהירות לאחר מחלה, פציעה או כל קושי שאני נתקל בו 💪",
    "ZPTI12": "15. זה לא הגיוני לדאוג לגבי העתיד, כי בכל מקרה אין שום דבר שאני יכול/ה לעשות כדי להשפיע עליו😐",
    "ZPTI3": "16. קורה לי הרבה שעולים לי זכרונות נעימים מהעבר 🌸",
    "ZPTI9": "17. קשה לי לשכוח סיטואציות ומצבים לא נעימים מהילדות שלי 😔",
    "RISC4": "18. התמודדות עם לחץ וקושי יהפכו אותי לחזק/ה יותר.💥",
    "Q3": " 🔁 כשאת/ה חושב/ת על עצמך, באיזו מידה כל אחד מההיגדים למטה נכונים לגביך?",
    "RISC3": "19. אני לא מתייאש/ת בקלות מכישלון. 🚫",
    "GRT1": "20. התגברתי בעבר על כשלונות כדי להגיע למטרות שהיו לי חשובות או משמעותיות 🌟",
    "ZPTI2": "21. אני מאוד אוהב/ת לשמוע סיפורים על העבר וללמוד מהם 📖",
    "ZPTI11": "22. הרבה דברים שאין לי שליטה עליהם משפיעים על מה שיקרה לי בחיים בהמשך מבחינת לימודים, עבודה וקריירה 🌍",
    "ZPTI5": "23. היו לי לא מעט דחיות וחוויות לא נעימות בעבר שלי ⚠️",
    "ICI6": "24. כשיש לי בעיה אני תמיד אקשיב לעצות של חברים או קרובי משפחה ואעשה מה שהם אומרים לי👂",
    "ZPTI8": "25. סיכונים שאני לוקח/ת מונעים מהחיים שלי להיות משעממים 🎢",
    "ICI3": "26. בכל פעם שמשהו טוב קורה לי יש לי הרגשה שזה קרה לי כי זה הגיע לי ✨",
    "ZPTI14": "27. יש לי יכולת לעמוד בפיתויים כשיש לי אחריות לבצע משימה🚫"
}



def return_text_by_the_id(id_name):
    for key in ids:
        if key == id_name:
            return ids[key]
    return None

# print(return_id('Q2'))
