import crop_for_llm
import llm_claude
import llm_gpt
import ids
import gd

# reflection_prompt="""
# המשתמש ענה על חידה. לאחר שענה נאמר לו האם התשובה היא נכונה או לא, והוצגו לו שאלות בנוגע לחוויה שלו בפתרון השאלה. 
# אני רוצה שהתלמיד אשר מילא את השאלון ילמד משהו חדש על עצמו דרך הניתוח שלך את תשובותיו, אנא עשה זאת. 
# מדובר בתלמיד בן 15, אנא התאם את השפה ואת הרמה בה הדברים כתובים, פשט את הדברים.
# אנא נסה לאתר האם הנבדק מאופיין יותר במוטיבציית למידה או מוטבציית הישג, ושלב זאת בתשובתך באופן בהיר ונהיר
# התלמיד לא מכיר את המושג מוטיבציית למידה ומוטיבציית הישג
# סיים את ההודעה בברכת הצלחה.
# """

hamarat_hegedim_prompt="""
שנה את ההיגדים שמובאים יחד עם תשובות הנבדק, כך שיהפכו לאמירות של הנבדק על עצמו.
כללים לשינוי ההיגדים לאמירות של הנבדק על עצמו:
1. כאשר ההיגד המקורי הוא היגד על אמונה, עמדה או תפיסה:
   - "דומה לחלוטין" - להשאיר את תוכן המשפט, להתחיל ב"אני מאמין ש..."
   - "דומה" - להתחיל ב"בדרך כלל אני מאמין ש..."
   - "קצת דומה"- השמט את המשפט!
   - "קצת לא דומה" - להפוך לשלילה, להתחיל ב"אני בדרך כלל לא מאמין ש..."
   - "לא דומה בכלל"  - להפוך לשלילה מוחלטת, להתחיל ב"אני לא מאמין ש..."
2. כאשר ההיגד המקורי מתאר תכונה, יכולת או התנהגות:
   - "דומה לחלוטין"  - להשאיר את תוכן המשפט, להתחיל ב"אני..."
   - "דומה"  - להתחיל ב"בדרך כלל אני..."
   - "קצת דומה" - השמט את המשפט!
   - "קצת לא דומה"  - להפוך לשלילה, להתחיל ב"לרוב אני לא..."
   - "לא דומה בכלל"  - להפוך לשלילה מוחלטת, להתחיל ב"אני לא..."
3. כאשר ההיגד מתאר כמות או תדירות:
   - "דומה לחלוטין" - הדבר קורה לנבדק בכמות או בתדירות שתוארה
   - "דומה" - הדבר קורה לנבדק בכמות או בתדירות שתוארה
   - "קצת דומה" -  השמט את המשפט!
   - "קצת לא דומה" - זה אומר שהנבדק חושב שזה כמעט ולא קורה לו
   - "לא דומה בכלל" - זה אומר שהנבדק חושב שזה לא קורה לו בכלל
4. כללים נוספים:
     - יש לשמור על המשמעות המקורית של ההיגד ולא להוסיף או לגרוע ממנה
   - יש להקפיד על ניסוח ברור וטבעי בשפה
- בצע השמטת המשפט גם בתגובות "קצת כמוני" ובתגובות "נכון לגבי באופן חלקי"
דוגמאות:
1. "יש לי רצון לקחת על עצמי משימות שדורשות ממני להיות אחראי על אחרים", "לא דומה בכלל" =
   "אני לא רוצה לקחת על עצמי משימות שדורשות ממני להיות אחראי על אחרים"
2. "יש לי נטיה להרגיש תחושות נוסטלגיות על דברים שקרו בעבר שלי", "דומה" =
   "בדרך כלל אני מרגיש תחושות נוסטלגיות על דברים שקרו בעבר שלי"
3. "יש בעבר שלי הרבה זכרונות לא נעימים", "קצת דומה" =
השמט את המשפט
4. "זה לא הגיוני לדאוג לגבי העתיד כי אי אפשר להשפיע עליו", "קצת לא דומה" =
   "אני חושב שיש טעם לדאוג לגבי העתיד כי אני יכול להשפיע עליו"
 
הקפד על:
* התאמת סגנון הניסוח לפי סוג ההיגד (אמונה/תכונה/תדירות)
* שמירה על המשמעות המקורית
* שימוש בשפה ברורה וטבעית
* התאמת הניסוח לרמת ההסכמה שהביע הנבדק
* כתוב רק את התוצאה הסופית!
ההיגדים ותשובות הנבדק:
"""
# hegedim_prompt="""
# לפניך היגדים של נער או נערה בני 15. הפק מתוכו פרופיל פסיכולוגי אותו תכתוב בשפה שמותאמת לבני נוער.
# התייחס לתמות של יחס לעבר, הווה ועתיד, התמודדות עם לחץ וקשיים, וערך עצמי.
# עטוף את אזורי הקושי בחוזקות. בסוף תן לו חלק של "עתידות". 
# כתוב זאת ישירות לנער או הנערה. המנע משימוש במושג "פרופיל פסיכולוגי"
# """

def get_reflection_prompt(gender):
   reflection_prompt=f"""
      המשתמש, נער או נערה, ענה על חידה. לאחר שענה נאמר לו האם התשובה היא נכונה או לא, והוצגו לו שאלות בנוגע לחוויה שלו בפתרון השאלה. אני רוצה שהתלמיד אשר מילא את השאלון ילמד משהו חדש על עצמו דרך הניתוח שלך את תשובותיו, אנא עשה זאת. אנא התאם את השפה ואת הרמה בה הדברים כתובים, פשט את הדברים. אנא נסה לאתר האם הנבדק מאופיין יותר במוטיבציית למידה או מוטבציית הישג, ושלב זאת בתשובתך באופן בהיר ונהיר. התלמיד לא מכיר את המושג מוטיבציית למידה ומוטיבציית הישג. סיים את ההודעה בברכת הצלחה.
      פנה בלשון {gender}
      write with markdown
      """
   return reflection_prompt

def get_hamarat_hegedim_prompt():
    return hamarat_hegedim_prompt
def get_hegedim_prompt(gender):
   hegedim_prompt=f"""
   לפניך היגדים של נער או נערה. הפק מתוכו פרופיל פסיכולוגי אותו תכתוב בשפה שמותאמת לבני נוער. 
התייחס לתמות של יחס לעבר, הווה ועתיד, התמודדות עם לחץ וקשיים, וערך עצמי. 
עטוף את אזורי הקושי בחוזקות. בסוף תן לו חלק של "עתידות".  
כתוב זאת ישירות לנער או הנערה. המנע משימוש במושג "פרופיל פסיכולוגי". 
כתוב זאת בפסקה אינטגרטיבית אחת, כ-100 מילים, תוך איחוד נושאים שונים לתמות, אל תוותר על נושאים.
      פנה בלשון {gender}
      write with markdown
      """
   return hegedim_prompt
# hegedim_prompt_old=f"""
#     לפניך היגדים של נער או נערה. הפק מתוכו פרופיל פסיכולוגי אותו תכתוב בשפה שמותאמת לבני נוער.
#       התייחס לתמות של יחס לעבר, הווה ועתיד, התמודדות עם לחץ וקשיים, וערך עצמי.
#       עטוף את אזורי הקושי בחוזקות. בסוף תן לו חלק של "עתידות". 
#       כתוב זאת ישירות לנער או הנערה. המנע משימוש במושג "פרופיל פסיכולוגי"!
#       פנה בלשון {gender}
#       write with markdown
#       """


# def give_feedback_reflection(conversation_history):
#     croped=crop_for_llm.crop_reflection(conversation_history)
#     string_format=crop_for_llm.data_to_string(croped)
#     #send_to_llm
#     text=llm_claude.return_llm_answer(string_format,reflection_prompt)
#     return text
    
    
# def give_feedback_hegedim(conversation_history):
#     save_data=[]
#     croped=crop_for_llm.crop_hegedim(conversation_history)
#     string_format=crop_for_llm.data_to_string(croped)
#     save_data.append(string_format)
    
#     translated_hegedim=llm_claude.return_llm_answer(string_format,hamarat_hegedim_prompt)
#     save_data.append(translated_hegedim) 
#     #send_to_llm for hegedim
#     text=llm_claude.return_llm_answer(translated_hegedim,hegedim_prompt)
#     save_data.append(text)
#     gd.add_row_to_sheet2(save_data)
#     return text
    
    
    
# data = """
# {'role': 'assistant', 'content': 'יש לי רצון לקחת על עצמי משימות שדורשות ממני להיות אחראי/ת על אחרים. 💪'}
# {'role': 'user', 'content': '😐 קצת דומה'}
# {'role': 'assistant', 'content': 'קורה לי הרבה שאני חושב/ת על דברים רעים שקרו לי. 😞'}
# {'role': 'user', 'content': '🙂 דומה'}
# {'role': 'assistant', 'content': 'יש בי אמונה שאי אפשר באמת לתכנן את העתיד כי דברים משתנים כל הזמן. 🤷‍♂️'}
# {'role': 'user', 'content': '🙂 דומה'}
# {'role': 'assistant', 'content': 'גם תחת לחץ, יש לי יכולת להשאר בפוקוס ולחשוב באופן בהיר. 🔍'}
# {'role': 'user', 'content': '😃 דומה לחלוטין'}
# {'role': 'assistant', 'content': 'מייאש אותי לעשות משהו שאני אראה את התוצאות שלו רק בעוד הרבה זמן. 😓'}
# {'role': 'user', 'content': '😃 דומה לחלוטין'}
# {'role': 'assistant', 'content': 'יש לי נטייה להרגיש תחושות של נוסטלגיות על דברים שקרו בעבר שלי. 🌟'}
# {'role': 'user', 'content': '😐 קצת דומה'}
# {'role': 'assistant', 'content': 'תמיד אסיים את כל המטלות למחר לפני שאצא לבלות או לנוח בערב של אותו היום. ⏰'}
# {'role': 'user', 'content': '🙂 דומה'}
# {'role': 'assistant', 'content': 'תמיד אעמוד בהבטחות שלי לחברים או לכל אחד אחר כמו המורה או ההורים שלי. ✔️'}
# {'role': 'user', 'content': '🙁 לא כל כך דומה'}
# {'role': 'assistant', 'content': 'יש לי יכולת להשלים פרויקטים בזמן על ידי כך שאני משקיע/ה בהם לאורך זמן ולא רק ברגע האחרון. 🕰️'}
# {'role': 'user', 'content': '😡 לא דומה בכלל'},
# {'role': 'assistant', 'content': '🔄 מה המידה שהנאמר למטה זהה לתפיסה שלך את עצמך?'}
# {'role': 'assistant', 'content': 'יש לי צורך שמישהו אחר יפרגן ויחמיא לי על העבודה שלי כדי שאהיה מרוצה ממה שעשיתי. 🙌'}
# {'role': 'user', 'content': 'קצת כמוני 😐'}
# """
    
    
# data = [
# {'role': 'assistant', 'content': '👋 אתם עומדים למלא שאלון מטעם תכנית ההייטק...'},
# {'role': 'assistant', 'content': 'מה המגדר שלך?'},
# {'role': 'user', 'content': 'נקבה'},
# {'role': 'assistant', 'content': 'באיזו כיתה את/ה?'},
# {'role': 'user', 'content': 'כיתה י'},
# {'role': 'assistant', 'content': 'תודה רבה'},
# {'role': 'assistant', 'content': 'בחר את שם בית הספר שלך:'},
# {'role': 'user', 'content': 'תיכון חדש דרכא - בת ים'},
# {'role': 'assistant', 'content': 'תודה'},
# {'role': 'user', 'content': 'עלחל'},
# {'role': 'assistant', 'content': 'תודה'},
# {'role': 'assistant', 'content': 'הרחבות (מלבד מתמטיקה ואנגלית) - אנא בחר/י את הקרוב ביותר'},
# {'role': 'user', 'content': 'מגמות אומנותיות'},
# {'role': 'assistant', 'content': 'האם את/ה מכיר/ה מישהו שעובד בהיי-טק?'},
# {'role': 'user', 'content': 'מישהו שלא קשור למשפחה'},
# {'role': 'assistant', 'content': 'האם אובחנת באופן רשמי עם אחד או יותר מהבאים?'},
# {'role': 'user', 'content': 'לא אובחנתי'},
# {'role': 'assistant', 'content': 'בחלק הקרוב יוצגו היגדים...'},
# {'role': 'assistant', 'content': '🤔 באיזו מידה ההתנהגות למטה דומה לדרך שבה את/ה מתנהג?'},
# {'role': 'assistant', 'content': 'יש לי רצון לקחת על עצמי משימות שדורשות ממני להיות אחראי/ת על אחרים. 💪'},
# {'role': 'user', 'content': '😐 קצת דומה'},
# {'role': 'assistant', 'content': 'קורה לי הרבה שאני חושב/ת על דברים רעים שקרו לי. 😞'},
# {'role': 'user', 'content': '🙂 דומה'},
# {'role': 'assistant', 'content': 'יש בי אמונה שאי אפשר באמת לתכנן את העתיד כי דברים משתנים כל הזמן. 🤷‍♂️'},
# {'role': 'user', 'content': '🙂 דומה'},
# {'role': 'assistant', 'content': 'גם תחת לחץ, יש לי יכולת להשאר בפוקוס ולחשוב באופן בהיר. 🔍'},
# {'role': 'user', 'content': '😃 דומה לחלוטין'},
# {'role': 'assistant', 'content': 'מייאש אותי לעשות משהו שאני אראה את התוצאות שלו רק בעוד הרבה זמן. 😓'},
# {'role': 'user', 'content': '😃 דומה לחלוטין'},
# {'role': 'assistant', 'content': 'יש לי נטייה להרגיש תחושות של נוסטלגיות על דברים שקרו בעבר שלי. 🌟'},
# {'role': 'user', 'content': '😐 קצת דומה'},
# {'role': 'assistant', 'content': 'תמיד אסיים את כל המטלות למחר לפני שאצא לבלות או לנוח בערב של אותו היום. ⏰'},
# {'role': 'user', 'content': '🙂 דומה'},
# {'role': 'assistant', 'content': 'תמיד אעמוד בהבטחות שלי לחברים או לכל אחד אחר כמו המורה או ההורים שלי. ✔️'},
# {'role': 'user', 'content': '🙁 לא כל כך דומה'},
# {'role': 'assistant', 'content': 'יש לי יכולת להשלים פרויקטים בזמן על ידי כך שאני משקיע/ה בהם לאורך זמן ולא רק ברגע האחרון. 🕰️'},
# {'role': 'user', 'content': '😡 לא דומה בכלל'},
# {'role': 'assistant', 'content': '🔄 מה המידה שהנאמר למטה זהה לתפיסה שלך את עצמך?'},
# {'role': 'assistant', 'content': 'יש לי צורך שמישהו אחר יפרגן ויחמיא לי על העבודה שלי כדי שאהיה מרוצה ממה שעשיתי. 🙌'},
# {'role': 'user', 'content': 'קצת כמוני 😐'}
# ]


# answer=give_feedback_hegedim(data)
# print(answer)
# answer=give_feedback_reflection(data)
# print(answer)