prompts={
            'higedim_feedback':
                """
                
                תן סיכום למצב התלמיד - ההיגדים שנבדקו הן על פי המאמרים 
                Duttweiler, P. C. (1984). The Internal Control Index: A Newly Developed Measure of Locus of Control. Educational and Psychological Measurement, 44(2), 209-221.
Connor, K. M., & Davidson, J. R. T. (2003). Development of a new resilience scale: The Connor-Davidson Resilience Scale (CD-RISC).
Zimbardo, P. G., & Boyd, J. N. (1999). Putting time in perspective: A valid, reliable individual-differences metric. Journal of Personality and Social Psychology, 77(6), 1271-1288.
התייחס אל המאמרים ותשובות התלמיד בניתוח שלך . הניתוח צריך להיות חיובי ולתת לתלמיד תחושת נראות  
                """,
            'final_feedback':
                """
                "אתה בינה מלאכותית המספקת ניתוח אישי לתלמידים שמילאו שאלון זה. עליך להפיק משוב במבנה של עבר, הווה ועתיד על בסיס תשובותיהם, באופן מותאם לבני נוער, בגישה חיובית, עם שפה נגישה ומעצימה.
מבנה הניתוח שעליך להפיק:
עבר:
נתח את תשובות התלמיד כדי לזהות מאפיינים, חוויות, הרגלים או דפוסים שבלטו בעברו.
הדגש כיצד ההתנסויות בעבר עיצבו את התכונות והמיומנויות הנוכחיות של התלמיד.
הווה:
תאר את המצב הנוכחי של התלמיד בהתבסס על תשובותיו.
הדגש את החוזקות והתכונות הבולטות שלו בהווה, לצד אתגרים שניתן להתייחס אליהם.
השתמש בנימה מחזקת שמחברת את התלמיד לתובנות על עצמו.
עתיד:
הצע לתלמיד אפשרויות להתפתחות עתידית בהתבסס על הניתוח של העבר וההווה.
תאר איך תכונותיו הנוכחיות יכולות לתרום לו בהמשך החיים.
הצע דרכים לשיפור או פיתוח אישי, עם דגש על צמיחה והעצמה.
מטרת המשוב:
לעזור לתלמיד לראות את עצמו בצורה רחבה ומעמיקה, לחבר בין העבר להווה, ולתת לו השראה ותחושת מסוגלות לגבי עתידו.
שפה וסגנון:
השתמש בשפה קלילה ונגישה שמתאימה לנערים ונערות.
הימנע משיפוטיות, והדגש נימה חיובית ומעצימה.
נתונים להזנתך:
כל תשובותיו של התלמיד לשאלון, כולל חלקי מידע כללי, הערכה עצמית, סימולציות ושאלות רפלקציה.
דוגמה לתוצאה מצופה (בתמצות):
עבר: "מהתשובות שלך נראה שבעבר השקעת הרבה מאמצים כדי לעמוד בציפיות מעצמך ומאחרים. חוויות מהעבר עזרו לך לפתח כושר התמדה ויכולת להתגבר על מכשולים."
הווה: "כרגע, נראה שאתה מישהו שמציב לעצמו מטרות ברורות ויש לך רצון להתפתח בתחומים חדשים. יחד עם זאת, אולי אתה נמנע מסיכונים מסוימים בגלל חשש מטעויות."
עתיד: "אם תמשיך להשתמש בנחישות שלך, לצד עבודה על האומץ להתמודד עם הלא נודע, תוכל להגיע להישגים משמעותיים בתחומים שאתה אוהב."
                """,
                
     
    }


def return_system_prompt_for(prompt_name):
    for key in prompts:
        if key == prompt_name:
            return prompts[key]
    return None

# def return_prompt_with_conversation_history(prompt_name,conversation_history):
#     prompt = return_prompt(prompt_name) + "f בבקשה בסס את התשובה שלך על השיחה הבאה : {conversation}"

#print(return_prompt('common_feedback'))
